src/Catalogs/__НастройкиОтбораОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>__НастройкиОтбораОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/__НастройкиОтбораОбъектов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбъектМетаданныхПриИзменении(Элемент)
	
	ИнициализироватьКомпоновщик();
	Элементы.КомпоновщикНастройкиОтбор.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщик()
	
	Если ЗначениеЗаполнено(Объект.ОбъектМетаданных) Тогда
		Справочники.__НастройкиОтбораОбъектов.ИнициализироватьКомпоновщик(Компоновщик, Объект.ОбъектМетаданных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновщик();
	
	Если Не ПустаяСтрока(Объект.Отбор) Тогда
		
		МодульОбщегоНазначения = __ОбщегоНазначенияСервер.ОбщийМодуль("ОбщегоНазначения", "__ОбщегоНазначенияСервер");
		ОтборКомпоновки = МодульОбщегоНазначения.ЗначениеИзСтрокиXML(Объект.Отбор);
		Компоновщик.Настройки.Отбор.Элементы.Очистить();
		Справочники.__НастройкиОтбораОбъектов.СкопироватьЭлементыОтбора(Компоновщик.Настройки.Отбор, ОтборКомпоновки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МодульОбщегоНазначения = __ОбщегоНазначенияСервер.ОбщийМодуль("ОбщегоНазначения", "__ОбщегоНазначенияСервер");
	ТекущийОбъект.Отбор = МодульОбщегоНазначения.ЗначениеВСтрокуXML(Компоновщик.Настройки.Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", "ВыборОбъекта");
	ПараметрыФормы.Вставить("ВыводитьТЧОбъектов", Истина);
	ПараметрыФормы.Вставить("ТекущийОбъект", Объект.ОбъектМетаданных);
	ПараметрыФормы.Вставить("ТипТекущегоОбъекта", Объект.ТипОбъекта);
	
	СписокТипов = Новый СписокЗначений;
	//Формируем список типов объектов
	СписокТипов.Добавить("Справочники");
	СписокТипов.Добавить("Документы");
	СписокТипов.Добавить("ПланыВидовХарактеристик");
	СписокТипов.Добавить("ПланыСчетов");
	СписокТипов.Добавить("ПланыВидовРасчета");
	
	ПараметрыФормы.Вставить("СписокТипов", СписокТипов);
	
	ОткрытьФорму("Справочник.__НастройкиОтбораОбъектов.Форма.ФормаВыбораОбъектаМетаданныхУправляемая", ПараметрыФормы
				, Элементы.ОбъектМетаданных);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДанныеФормыЭлементДерева") Тогда
		
		Объект.ОбъектМетаданных = ВыбранноеЗначение.ТипЗначения + "." + ВыбранноеЗначение.ИдентификаторПоля;
		
		Модифицированность = Истина;
		
		ИнициализироватьКомпоновщик();
		
		Элементы.КомпоновщикНастройкиОтбор.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры
